Klipper3d/klipper/lib/asf/sam/utils/cmsis/sams70/include/pio/sams70q19b.h
/**
 * \file
 *
 * Copyright (c) 2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAMS70Q19B_PIO_
#define _SAMS70Q19B_PIO_

#define PIO_PA0                   (1u << 0)  /**< \brief Pin Controlled by PA0 */
#define PIO_PA1                   (1u << 1)  /**< \brief Pin Controlled by PA1 */
#define PIO_PA2                   (1u << 2)  /**< \brief Pin Controlled by PA2 */
#define PIO_PA3                   (1u << 3)  /**< \brief Pin Controlled by PA3 */
#define PIO_PA4                   (1u << 4)  /**< \brief Pin Controlled by PA4 */
#define PIO_PA5                   (1u << 5)  /**< \brief Pin Controlled by PA5 */
#define PIO_PA6                   (1u << 6)  /**< \brief Pin Controlled by PA6 */
#define PIO_PA7                   (1u << 7)  /**< \brief Pin Controlled by PA7 */
#define PIO_PA8                   (1u << 8)  /**< \brief Pin Controlled by PA8 */
#define PIO_PA9                   (1u << 9)  /**< \brief Pin Controlled by PA9 */
#define PIO_PA10                  (1u << 10) /**< \brief Pin Controlled by PA10 */
#define PIO_PA11                  (1u << 11) /**< \brief Pin Controlled by PA11 */
#define PIO_PA12                  (1u << 12) /**< \brief Pin Controlled by PA12 */
#define PIO_PA13                  (1u << 13) /**< \brief Pin Controlled by PA13 */
#define PIO_PA14                  (1u << 14) /**< \brief Pin Controlled by PA14 */
#define PIO_PA15                  (1u << 15) /**< \brief Pin Controlled by PA15 */
#define PIO_PA16                  (1u << 16) /**< \brief Pin Controlled by PA16 */
#define PIO_PA17                  (1u << 17) /**< \brief Pin Controlled by PA17 */
#define PIO_PA18                  (1u << 18) /**< \brief Pin Controlled by PA18 */
#define PIO_PA19                  (1u << 19) /**< \brief Pin Controlled by PA19 */
#define PIO_PA20                  (1u << 20) /**< \brief Pin Controlled by PA20 */
#define PIO_PA21                  (1u << 21) /**< \brief Pin Controlled by PA21 */
#define PIO_PA22                  (1u << 22) /**< \brief Pin Controlled by PA22 */
#define PIO_PA23                  (1u << 23) /**< \brief Pin Controlled by PA23 */
#define PIO_PA24                  (1u << 24) /**< \brief Pin Controlled by PA24 */
#define PIO_PA25                  (1u << 25) /**< \brief Pin Controlled by PA25 */
#define PIO_PA26                  (1u << 26) /**< \brief Pin Controlled by PA26 */
#define PIO_PA27                  (1u << 27) /**< \brief Pin Controlled by PA27 */
#define PIO_PA28                  (1u << 28) /**< \brief Pin Controlled by PA28 */
#define PIO_PA29                  (1u << 29) /**< \brief Pin Controlled by PA29 */
#define PIO_PA30                  (1u << 30) /**< \brief Pin Controlled by PA30 */
#define PIO_PA31                  (1u << 31) /**< \brief Pin Controlled by PA31 */
#define PIO_PB0                   (1u << 0)  /**< \brief Pin Controlled by PB0 */
#define PIO_PB1                   (1u << 1)  /**< \brief Pin Controlled by PB1 */
#define PIO_PB2                   (1u << 2)  /**< \brief Pin Controlled by PB2 */
#define PIO_PB3                   (1u << 3)  /**< \brief Pin Controlled by PB3 */
#define PIO_PB4                   (1u << 4)  /**< \brief Pin Controlled by PB4 */
#define PIO_PB5                   (1u << 5)  /**< \brief Pin Controlled by PB5 */
#define PIO_PB6                   (1u << 6)  /**< \brief Pin Controlled by PB6 */
#define PIO_PB7                   (1u << 7)  /**< \brief Pin Controlled by PB7 */
#define PIO_PB8                   (1u << 8)  /**< \brief Pin Controlled by PB8 */
#define PIO_PB9                   (1u << 9)  /**< \brief Pin Controlled by PB9 */
#define PIO_PB12                  (1u << 12) /**< \brief Pin Controlled by PB12 */
#define PIO_PB13                  (1u << 13) /**< \brief Pin Controlled by PB13 */
#define PIO_PC0                   (1u << 0)  /**< \brief Pin Controlled by PC0 */
#define PIO_PC1                   (1u << 1)  /**< \brief Pin Controlled by PC1 */
#define PIO_PC2                   (1u << 2)  /**< \brief Pin Controlled by PC2 */
#define PIO_PC3                   (1u << 3)  /**< \brief Pin Controlled by PC3 */
#define PIO_PC4                   (1u << 4)  /**< \brief Pin Controlled by PC4 */
#define PIO_PC5                   (1u << 5)  /**< \brief Pin Controlled by PC5 */
#define PIO_PC6                   (1u << 6)  /**< \brief Pin Controlled by PC6 */
#define PIO_PC7                   (1u << 7)  /**< \brief Pin Controlled by PC7 */
#define PIO_PC8                   (1u << 8)  /**< \brief Pin Controlled by PC8 */
#define PIO_PC9                   (1u << 9)  /**< \brief Pin Controlled by PC9 */
#define PIO_PC10                  (1u << 10) /**< \brief Pin Controlled by PC10 */
#define PIO_PC11                  (1u << 11) /**< \brief Pin Controlled by PC11 */
#define PIO_PC12                  (1u << 12) /**< \brief Pin Controlled by PC12 */
#define PIO_PC13                  (1u << 13) /**< \brief Pin Controlled by PC13 */
#define PIO_PC14                  (1u << 14) /**< \brief Pin Controlled by PC14 */
#define PIO_PC15                  (1u << 15) /**< \brief Pin Controlled by PC15 */
#define PIO_PC16                  (1u << 16) /**< \brief Pin Controlled by PC16 */
#define PIO_PC17                  (1u << 17) /**< \brief Pin Controlled by PC17 */
#define PIO_PC18                  (1u << 18) /**< \brief Pin Controlled by PC18 */
#define PIO_PC19                  (1u << 19) /**< \brief Pin Controlled by PC19 */
#define PIO_PC20                  (1u << 20) /**< \brief Pin Controlled by PC20 */
#define PIO_PC21                  (1u << 21) /**< \brief Pin Controlled by PC21 */
#define PIO_PC22                  (1u << 22) /**< \brief Pin Controlled by PC22 */
#define PIO_PC23                  (1u << 23) /**< \brief Pin Controlled by PC23 */
#define PIO_PC24                  (1u << 24) /**< \brief Pin Controlled by PC24 */
#define PIO_PC25                  (1u << 25) /**< \brief Pin Controlled by PC25 */
#define PIO_PC26                  (1u << 26) /**< \brief Pin Controlled by PC26 */
#define PIO_PC27                  (1u << 27) /**< \brief Pin Controlled by PC27 */
#define PIO_PC28                  (1u << 28) /**< \brief Pin Controlled by PC28 */
#define PIO_PC29                  (1u << 29) /**< \brief Pin Controlled by PC29 */
#define PIO_PC30                  (1u << 30) /**< \brief Pin Controlled by PC30 */
#define PIO_PC31                  (1u << 31) /**< \brief Pin Controlled by PC31 */
#define PIO_PD0                   (1u << 0)  /**< \brief Pin Controlled by PD0 */
#define PIO_PD1                   (1u << 1)  /**< \brief Pin Controlled by PD1 */
#define PIO_PD2                   (1u << 2)  /**< \brief Pin Controlled by PD2 */
#define PIO_PD3                   (1u << 3)  /**< \brief Pin Controlled by PD3 */
#define PIO_PD4                   (1u << 4)  /**< \brief Pin Controlled by PD4 */
#define PIO_PD5                   (1u << 5)  /**< \brief Pin Controlled by PD5 */
#define PIO_PD6                   (1u << 6)  /**< \brief Pin Controlled by PD6 */
#define PIO_PD7                   (1u << 7)  /**< \brief Pin Controlled by PD7 */
#define PIO_PD8                   (1u << 8)  /**< \brief Pin Controlled by PD8 */
#define PIO_PD9                   (1u << 9)  /**< \brief Pin Controlled by PD9 */
#define PIO_PD10                  (1u << 10) /**< \brief Pin Controlled by PD10 */
#define PIO_PD11                  (1u << 11) /**< \brief Pin Controlled by PD11 */
#define PIO_PD12                  (1u << 12) /**< \brief Pin Controlled by PD12 */
#define PIO_PD13                  (1u << 13) /**< \brief Pin Controlled by PD13 */
#define PIO_PD14                  (1u << 14) /**< \brief Pin Controlled by PD14 */
#define PIO_PD15                  (1u << 15) /**< \brief Pin Controlled by PD15 */
#define PIO_PD16                  (1u << 16) /**< \brief Pin Controlled by PD16 */
#define PIO_PD17                  (1u << 17) /**< \brief Pin Controlled by PD17 */
#define PIO_PD18                  (1u << 18) /**< \brief Pin Controlled by PD18 */
#define PIO_PD19                  (1u << 19) /**< \brief Pin Controlled by PD19 */
#define PIO_PD20                  (1u << 20) /**< \brief Pin Controlled by PD20 */
#define PIO_PD21                  (1u << 21) /**< \brief Pin Controlled by PD21 */
#define PIO_PD22                  (1u << 22) /**< \brief Pin Controlled by PD22 */
#define PIO_PD23                  (1u << 23) /**< \brief Pin Controlled by PD23 */
#define PIO_PD24                  (1u << 24) /**< \brief Pin Controlled by PD24 */
#define PIO_PD25                  (1u << 25) /**< \brief Pin Controlled by PD25 */
#define PIO_PD26                  (1u << 26) /**< \brief Pin Controlled by PD26 */
#define PIO_PD27                  (1u << 27) /**< \brief Pin Controlled by PD27 */
#define PIO_PD28                  (1u << 28) /**< \brief Pin Controlled by PD28 */
#define PIO_PD29                  (1u << 29) /**< \brief Pin Controlled by PD29 */
#define PIO_PD30                  (1u << 30) /**< \brief Pin Controlled by PD30 */
#define PIO_PD31                  (1u << 31) /**< \brief Pin Controlled by PD31 */
#define PIO_PE0                   (1u << 0)  /**< \brief Pin Controlled by PE0 */
#define PIO_PE1                   (1u << 1)  /**< \brief Pin Controlled by PE1 */
#define PIO_PE2                   (1u << 2)  /**< \brief Pin Controlled by PE2 */
#define PIO_PE3                   (1u << 3)  /**< \brief Pin Controlled by PE3 */
#define PIO_PE4                   (1u << 4)  /**< \brief Pin Controlled by PE4 */
#define PIO_PE5                   (1u << 5)  /**< \brief Pin Controlled by PE5 */
/* ========== Pio definition for AFEC0 peripheral ========== */
#define PIO_PD30X1_AFE0_AD0       (1u << 30) /**< \brief Afec0 signal: AFE0_AD0 */
#define PIO_PA21X1_AFE0_AD1       (1u << 21) /**< \brief Afec0 signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA21X1_PIODCEN2       (1u << 21) /**< \brief Afec0 signal: AFE0_AD1/PIODCEN2 */
#define PIO_PB0X1_AFE0_AD10       (1u << 0)  /**< \brief Afec0 signal: AFE0_AD10/RTCOUT0 */
#define PIO_PB0X1_RTCOUT0         (1u << 0)  /**< \brief Afec0 signal: AFE0_AD10/RTCOUT0 */
#define PIO_PB3X1_AFE0_AD2        (1u << 3)  /**< \brief Afec0 signal: AFE0_AD2/WKUP12 */
#define PIO_PB3X1_WKUP12          (1u << 3)  /**< \brief Afec0 signal: AFE0_AD2/WKUP12 */
#define PIO_PE5X1_AFE0_AD3        (1u << 5)  /**< \brief Afec0 signal: AFE0_AD3 */
#define PIO_PE4X1_AFE0_AD4        (1u << 4)  /**< \brief Afec0 signal: AFE0_AD4 */
#define PIO_PB2X1_AFE0_AD5        (1u << 2)  /**< \brief Afec0 signal: AFE0_AD5 */
#define PIO_PA17X1_AFE0_AD6       (1u << 17) /**< \brief Afec0 signal: AFE0_AD6 */
#define PIO_PA18X1_AFE0_AD7       (1u << 18) /**< \brief Afec0 signal: AFE0_AD7 */
#define PIO_PA19X1_AFE0_AD8       (1u << 19) /**< \brief Afec0 signal: AFE0_AD8/WKUP9 */
#define PIO_PA19X1_WKUP9          (1u << 19) /**< \brief Afec0 signal: AFE0_AD8/WKUP9 */
#define PIO_PA20X1_AFE0_AD9       (1u << 20) /**< \brief Afec0 signal: AFE0_AD9/WKUP10 */
#define PIO_PA20X1_WKUP10         (1u << 20) /**< \brief Afec0 signal: AFE0_AD9/WKUP10 */
#define PIO_PA8B_AFE0_ADTRG       (1u << 8)  /**< \brief Afec0 signal: AFE0_ADTRG */
/* ========== Pio definition for AFEC1 peripheral ========== */
#define PIO_PB1X1_AFE1_AD0        (1u << 1)  /**< \brief Afec1 signal: AFE1_AD0/RTCOUT1 */
#define PIO_PB1X1_RTCOUT1         (1u << 1)  /**< \brief Afec1 signal: AFE1_AD0/RTCOUT1 */
#define PIO_PC13X1_AFE1_AD1       (1u << 13) /**< \brief Afec1 signal: AFE1_AD1 */
#define PIO_PE3X1_AFE1_AD10       (1u << 3)  /**< \brief Afec1 signal: AFE1_AD10 */
#define PIO_PE0X1_AFE1_AD11       (1u << 0)  /**< \brief Afec1 signal: AFE1_AD11 */
#define PIO_PC15X1_AFE1_AD2       (1u << 15) /**< \brief Afec1 signal: AFE1_AD2 */
#define PIO_PC12X1_AFE1_AD3       (1u << 12) /**< \brief Afec1 signal: AFE1_AD3 */
#define PIO_PC29X1_AFE1_AD4       (1u << 29) /**< \brief Afec1 signal: AFE1_AD4 */
#define PIO_PC30X1_AFE1_AD5       (1u << 30) /**< \brief Afec1 signal: AFE1_AD5 */
#define PIO_PC31X1_AFE1_AD6       (1u << 31) /**< \brief Afec1 signal: AFE1_AD6 */
#define PIO_PC26X1_AFE1_AD7       (1u << 26) /**< \brief Afec1 signal: AFE1_AD7 */
#define PIO_PC27X1_AFE1_AD8       (1u << 27) /**< \brief Afec1 signal: AFE1_AD8 */
#define PIO_PC0X1_AFE1_AD9        (1u << 0)  /**< \brief Afec1 signal: AFE1_AD9 */
#define PIO_PD9C_AFE1_ADTRG       (1u << 9)  /**< \brief Afec1 signal: AFE1_ADTRG */
/* ========== Pio definition for ARM peripheral ========== */
#define PIO_PB7X1_SWCLK           (1u << 7)  /**< \brief Arm signal: SWCLK/TCK */
#define PIO_PB7X1_TCK             (1u << 7)  /**< \brief Arm signal: SWCLK/TCK */
#define PIO_PB6X1_SWDIO           (1u << 6)  /**< \brief Arm signal: SWDIO/TMS */
#define PIO_PB6X1_TMS             (1u << 6)  /**< \brief Arm signal: SWDIO/TMS */
#define PIO_PB4X1_TDI             (1u << 4)  /**< \brief Arm signal: TDI */
#define PIO_PB5X1_TDO             (1u << 5)  /**< \brief Arm signal: TDO/TRACESWO/WKUP13 */
#define PIO_PB5X1_TRACESWO        (1u << 5)  /**< \brief Arm signal: TDO/TRACESWO/WKUP13 */
#define PIO_PB5X1_WKUP13          (1u << 5)  /**< \brief Arm signal: TDO/TRACESWO/WKUP13 */
/* ========== Pio definition for DACC peripheral ========== */
#define PIO_PB13X1_DAC0           (1u << 13) /**< \brief Dacc signal: DAC0 */
#define PIO_PD0X1_DAC1            (1u << 0)  /**< \brief Dacc signal: DAC1 */
#define PIO_PA2C_DATRG            (1u << 2)  /**< \brief Dacc signal: DATRG */
/* ========== Pio definition for EBI peripheral ========== */
#define PIO_PC18A_A0              (1u << 18) /**< \brief Ebi signal: A0/NBS0 */
#define PIO_PC18A_NBS0            (1u << 18) /**< \brief Ebi signal: A0/NBS0 */
#define PIO_PC19A_A1              (1u << 19) /**< \brief Ebi signal: A1 */
#define PIO_PC28A_A10             (1u << 28) /**< \brief Ebi signal: A10 */
#define PIO_PC29A_A11             (1u << 29) /**< \brief Ebi signal: A11 */
#define PIO_PC30A_A12             (1u << 30) /**< \brief Ebi signal: A12 */
#define PIO_PC31A_A13             (1u << 31) /**< \brief Ebi signal: A13 */
#define PIO_PA18C_A14             (1u << 18) /**< \brief Ebi signal: A14 */
#define PIO_PA19C_A15             (1u << 19) /**< \brief Ebi signal: A15 */
#define PIO_PA20C_A16             (1u << 20) /**< \brief Ebi signal: A16/BA0 */
#define PIO_PA20C_BA0             (1u << 20) /**< \brief Ebi signal: A16/BA0 */
#define PIO_PA0C_A17              (1u << 0)  /**< \brief Ebi signal: A17/BA1 */
#define PIO_PA0C_BA1              (1u << 0)  /**< \brief Ebi signal: A17/BA1 */
#define PIO_PA1C_A18              (1u << 1)  /**< \brief Ebi signal: A18 */
#define PIO_PA23C_A19             (1u << 23) /**< \brief Ebi signal: A19 */
#define PIO_PC20A_A2              (1u << 20) /**< \brief Ebi signal: A2 */
#define PIO_PA24C_A20             (1u << 24) /**< \brief Ebi signal: A20 */
#define PIO_PC16A_A21             (1u << 16) /**< \brief Ebi signal: A21/NANDALE */
#define PIO_PC16A_NANDALE         (1u << 16) /**< \brief Ebi signal: A21/NANDALE */
#define PIO_PC17A_A22             (1u << 17) /**< \brief Ebi signal: A22/NANDCLE */
#define PIO_PC17A_NANDCLE         (1u << 17) /**< \brief Ebi signal: A22/NANDCLE */
#define PIO_PA25C_A23             (1u << 25) /**< \brief Ebi signal: A23 */
#define PIO_PC21A_A3              (1u << 21) /**< \brief Ebi signal: A3 */
#define PIO_PC22A_A4              (1u << 22) /**< \brief Ebi signal: A4 */
#define PIO_PC23A_A5              (1u << 23) /**< \brief Ebi signal: A5 */
#define PIO_PC24A_A6              (1u << 24) /**< \brief Ebi signal: A6 */
#define PIO_PC25A_A7              (1u << 25) /**< \brief Ebi signal: A7 */
#define PIO_PC26A_A8              (1u << 26) /**< \brief Ebi signal: A8 */
#define PIO_PC27A_A9              (1u << 27) /**< \brief Ebi signal: A9 */
#define PIO_PD17C_CAS             (1u << 17) /**< \brief Ebi signal: CAS */
#define PIO_PC0A_D0               (1u << 0)  /**< \brief Ebi signal: D0 */
#define PIO_PC1A_D1               (1u << 1)  /**< \brief Ebi signal: D1 */
#define PIO_PE2A_D10              (1u << 2)  /**< \brief Ebi signal: D10 */
#define PIO_PE3A_D11              (1u << 3)  /**< \brief Ebi signal: D11 */
#define PIO_PE4A_D12              (1u << 4)  /**< \brief Ebi signal: D12 */
#define PIO_PE5A_D13              (1u << 5)  /**< \brief Ebi signal: D13 */
#define PIO_PA15A_D14             (1u << 15) /**< \brief Ebi signal: D14 */
#define PIO_PA16A_D15             (1u << 16) /**< \brief Ebi signal: D15 */
#define PIO_PC2A_D2               (1u << 2)  /**< \brief Ebi signal: D2 */
#define PIO_PC3A_D3               (1u << 3)  /**< \brief Ebi signal: D3 */
#define PIO_PC4A_D4               (1u << 4)  /**< \brief Ebi signal: D4 */
#define PIO_PC5A_D5               (1u << 5)  /**< \brief Ebi signal: D5 */
#define PIO_PC6A_D6               (1u << 6)  /**< \brief Ebi signal: D6 */
#define PIO_PC7A_D7               (1u << 7)  /**< \brief Ebi signal: D7 */
#define PIO_PE0A_D8               (1u << 0)  /**< \brief Ebi signal: D8 */
#define PIO_PE1A_D9               (1u << 1)  /**< \brief Ebi signal: D9 */
#define PIO_PC9A_NANDOE           (1u << 9)  /**< \brief Ebi signal: NANDOE */
#define PIO_PC10A_NANDWE          (1u << 10) /**< \brief Ebi signal: NANDWE */
#define PIO_PC14A_NCS0            (1u << 14) /**< \brief Ebi signal: NCS0 */
#define PIO_PC15A_NCS1            (1u << 15) /**< \brief Ebi signal: NCS1/SDCS */
#define PIO_PC15A_SDCS            (1u << 15) /**< \brief Ebi signal: NCS1/SDCS */
#define PIO_PD18A_NCS1            (1u << 18) /**< \brief Ebi signal: NCS1/SDCS */
#define PIO_PD18A_SDCS            (1u << 18) /**< \brief Ebi signal: NCS1/SDCS */
#define PIO_PA22C_NCS2            (1u << 22) /**< \brief Ebi signal: NCS2 */
#define PIO_PC12A_NCS3            (1u << 12) /**< \brief Ebi signal: NCS3 */
#define PIO_PD19A_NCS3            (1u << 19) /**< \brief Ebi signal: NCS3 */
#define PIO_PC11A_NRD             (1u << 11) /**< \brief Ebi signal: NRD */
#define PIO_PC13A_NWAIT           (1u << 13) /**< \brief Ebi signal: NWAIT */
#define PIO_PC8A_NWR0             (1u << 8)  /**< \brief Ebi signal: NWR0/NWE */
#define PIO_PC8A_NWE              (1u << 8)  /**< \brief Ebi signal: NWR0/NWE */
#define PIO_PD15C_NWR1            (1u << 15) /**< \brief Ebi signal: NWR1/NBS1 */
#define PIO_PD15C_NBS1            (1u << 15) /**< \brief Ebi signal: NWR1/NBS1 */
#define PIO_PD16C_RAS             (1u << 16) /**< \brief Ebi signal: RAS */
#define PIO_PC13C_SDA10           (1u << 13) /**< \brief Ebi signal: SDA10 */
#define PIO_PD13C_SDA10           (1u << 13) /**< \brief Ebi signal: SDA10 */
#define PIO_PD23C_SDCK            (1u << 23) /**< \brief Ebi signal: SDCK */
#define PIO_PD14C_SDCKE           (1u << 14) /**< \brief Ebi signal: SDCKE */
#define PIO_PD29C_SDWE            (1u << 29) /**< \brief Ebi signal: SDWE */
/* ========== Pio definition for HSMCI peripheral ========== */
#define PIO_PA28C_MCCDA           (1u << 28) /**< \brief Hsmci signal: MCCDA */
#define PIO_PA25D_MCCK            (1u << 25) /**< \brief Hsmci signal: MCCK */
#define PIO_PA30C_MCDA0           (1u << 30) /**< \brief Hsmci signal: MCDA0 */
#define PIO_PA31C_MCDA1           (1u << 31) /**< \brief Hsmci signal: MCDA1 */
#define PIO_PA26C_MCDA2           (1u << 26) /**< \brief Hsmci signal: MCDA2 */
#define PIO_PA27C_MCDA3           (1u << 27) /**< \brief Hsmci signal: MCDA3 */
/* ========== Pio definition for I2SC0 peripheral ========== */
#define PIO_PA1D_I2SC0_CK          (1u << 1)  /**< \brief I2sc0 signal: I2SC0_CK */
#define PIO_PA16D_I2SC0_DI0        (1u << 16) /**< \brief I2sc0 signal: I2SC0_DI0 */
#define PIO_PA30D_I2SC0_DO0        (1u << 30) /**< \brief I2sc0 signal: I2SC0_DO0 */
#define PIO_PA0D_I2SC0_MCK         (1u << 0)  /**< \brief I2sc0 signal: I2SC0_MCK */
#define PIO_PA15D_I2SC0_WS         (1u << 15) /**< \brief I2sc0 signal: I2SC0_WS */
/* ========== Pio definition for I2SC1 peripheral ========== */
#define PIO_PA20D_I2SC1_CK         (1u << 20) /**< \brief I2sc1 signal: I2SC1_CK */
#define PIO_PE2C_I2SC1_DI0         (1u << 2)  /**< \brief I2sc1 signal: I2SC1_DI0 */
#define PIO_PE1C_I2SC1_DO0         (1u << 1)  /**< \brief I2sc1 signal: I2SC1_DO0 */
#define PIO_PA19D_I2SC1_MCK        (1u << 19) /**< \brief I2sc1 signal: I2SC1_MCK */
#define PIO_PE0C_I2SC1_WS          (1u << 0)  /**< \brief I2sc1 signal: I2SC1_WS */
/* ========== Pio definition for ISI peripheral ========== */
#define PIO_PD22D_ISI_D0          (1u << 22) /**< \brief Isi signal: ISI_D0 */
#define PIO_PD21D_ISI_D1          (1u << 21) /**< \brief Isi signal: ISI_D1 */
#define PIO_PD30D_ISI_D10         (1u << 30) /**< \brief Isi signal: ISI_D10 */
#define PIO_PD31D_ISI_D11         (1u << 31) /**< \brief Isi signal: ISI_D11 */
#define PIO_PB3D_ISI_D2           (1u << 3)  /**< \brief Isi signal: ISI_D2 */
#define PIO_PA9B_ISI_D3           (1u << 9)  /**< \brief Isi signal: ISI_D3 */
#define PIO_PA5B_ISI_D4           (1u << 5)  /**< \brief Isi signal: ISI_D4 */
#define PIO_PD11D_ISI_D5          (1u << 11) /**< \brief Isi signal: ISI_D5 */
#define PIO_PD12D_ISI_D6          (1u << 12) /**< \brief Isi signal: ISI_D6 */
#define PIO_PA27D_ISI_D7          (1u << 27) /**< \brief Isi signal: ISI_D7 */
#define PIO_PD27D_ISI_D8          (1u << 27) /**< \brief Isi signal: ISI_D8 */
#define PIO_PD28D_ISI_D9          (1u << 28) /**< \brief Isi signal: ISI_D9 */
#define PIO_PD24D_ISI_HSYNC       (1u << 24) /**< \brief Isi signal: ISI_HSYNC */
#define PIO_PA24D_ISI_PCK         (1u << 24) /**< \brief Isi signal: ISI_PCK */
#define PIO_PD25D_ISI_VSYNC       (1u << 25) /**< \brief Isi signal: ISI_VSYNC */
/* ========== Pio definition for PIOA peripheral ========== */
#define PIO_PA21X1_AFE0_AD1       (1u << 21) /**< \brief Pioa signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA21X1_PIODCEN2       (1u << 21) /**< \brief Pioa signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA3X1_PIODC0          (1u << 3)  /**< \brief Pioa signal: PIODC0 */
#define PIO_PA10X1_PIODC4         (1u << 10) /**< \brief Pioa signal: PIODC4 */
#define PIO_PA12X1_PIODC6         (1u << 12) /**< \brief Pioa signal: PIODC6 */
#define PIO_PA13X1_PIODC7         (1u << 13) /**< \brief Pioa signal: PIODC7 */
#define PIO_PA22X1_PIODCCLK       (1u << 22) /**< \brief Pioa signal: PIODCCLK */
#define PIO_PA4X1_WKUP3           (1u << 4)  /**< \brief Pioa signal: WKUP3/PIODC1 */
#define PIO_PA4X1_PIODC1          (1u << 4)  /**< \brief Pioa signal: WKUP3/PIODC1 */
#define PIO_PA5X1_WKUP4           (1u << 5)  /**< \brief Pioa signal: WKUP4/PIODC2 */
#define PIO_PA5X1_PIODC2          (1u << 5)  /**< \brief Pioa signal: WKUP4/PIODC2 */
#define PIO_PA9X1_WKUP6           (1u << 9)  /**< \brief Pioa signal: WKUP6/PIODC3 */
#define PIO_PA9X1_PIODC3          (1u << 9)  /**< \brief Pioa signal: WKUP6/PIODC3 */
